clase 18 Logging Testing Clusters Escalabilidad/pruebas/artillery4/prueba.yml
config:
    target: 'http://localhost:3000'
    phases:
      - duration: 10
        arrivalRate: 50 
scenarios:
  - name: 'Agregar usuario'
    flow:
      - get:
            url: '/usuario'    
            capture:
              - json: $.nombre
                as: nombreUsuario
      - post:
            url: '/usuarios'
            json:
                nombre: '{{nombreUsuario}}'
            capture:
              - json: $.id
                as: idUsuario
      - get:
            url: '/usuarios/{{idUsuario}}'    
      - get:
            url: '/usuarios/99999'